IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_EQEP2_CONTROLSS_EQEP2.xml
	<register id="CONTROLSS_EQEP2_QCTMR" acronym="CONTROLSS_EQEP2_QCTMR" offset="0x3A" width="16" description="">
		<bitfield id="QCTMR" width="16" begin="15" end="0" resetval="0x0" description="This register provides time base for edge capture unit." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP2_QCPRD" acronym="CONTROLSS_EQEP2_QCPRD" offset="0x3C" width="16" description="">
		<bitfield id="QCPRD" width="16" begin="15" end="0" resetval="0x0" description="This register holds the period count value between the last successive eQEP position events" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP2_QCTMRLAT" acronym="CONTROLSS_EQEP2_QCTMRLAT" offset="0x3E" width="16" description="">
		<bitfield id="QCTMRLAT" width="16" begin="15" end="0" resetval="0x0" description="The eQEP capture timer value can be latched into this register on two events viz., unit timeout event, reading the eQEP position counter." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP2_QCPRDLAT" acronym="CONTROLSS_EQEP2_QCPRDLAT" offset="0x40" width="16" description="">
		<bitfield id="QCPRDLAT" width="16" begin="15" end="0" resetval="0x0" description="eQEP capture period value can be latched into this register on two events viz., unit timeout event, reading the eQEP position counter." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP2_REV" acronym="CONTROLSS_EQEP2_REV" offset="0x60" width="32" description="">
		<bitfield id="MINOR" width="3" begin="5" end="3" resetval="0x2" description="This field specifies the Minor Revision number for the eQEP IP." range="5 - 3" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="2" end="0" resetval="0x1" description="This field specifies the Major Revision number for the eQEP IP." range="2 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP2_QEPSTROBESEL" acronym="CONTROLSS_EQEP2_QEPSTROBESEL" offset="0x64" width="32" description="">
		<bitfield id="STROBESEL" width="2" begin="1" end="0" resetval="0x0" description="Strobe source select:    0x0   |   QS_AFTER_POL_MUXQEP Strobe after polarity mux      0x1   |   QS_AFTER_POL_MUXQEP Strobe after polarity mux      0x2   |   ADCSOCA_AS_QSQEP Strobe after polarity mux ORed with ADCSOCA      0x3   |   ADCSOCB_AS_QSQEP Strobe after polarity mux ORed with ADCSOCB  " range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP2_QMACTRL" acronym="CONTROLSS_EQEP2_QMACTRL" offset="0x68" width="32" description="">
		<bitfield id="MODE" width="3" begin="2" end="0" resetval="0x0" description="Select Mode for QMA mode: 000 : QMA Module is bypassed.  001 : QMA Mode-1 operation selected 010 : QMA Mode-2 operation selected 011 : QMA Module is bypassed (reserved) 1xx  : QMA Module is bypassed (reserved)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP2_QEPSRCSEL" acronym="CONTROLSS_EQEP2_QEPSRCSEL" offset="0x6C" width="32" description="">
		<bitfield id="QEPSSEL" width="5" begin="28" end="24" resetval="0x0" description="QEP Strobe source select:  0x0: Device Pin (Default) 0x1 to 0x1F : To be defined in SOC context  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="28 - 24" rwaccess="RW"/> 
		<bitfield id="QEPISEL" width="5" begin="20" end="16" resetval="0x0" description="QEP Index source select: 0x0: Device Pin (Default) 0x1 to 0x1F : To be defined in SOC context  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="20 - 16" rwaccess="RW"/> 
		<bitfield id="QEPBSEL" width="5" begin="12" end="8" resetval="0x0" description="QEPB source select: 0x0: Device Pin (Default) 0x1 to 0x1F : To be defined in SOC context  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="12 - 8" rwaccess="RW"/> 
		<bitfield id="QEPASEL" width="5" begin="4" end="0" resetval="0x0" description="QEPA source select: 0x0: Device Pin (Default) 0x1 to 0x1F : To be defined in SOC context  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="4 - 0" rwaccess="RW"/>
	</register>
</module>